{
    "AlbumID": "0002",
    "Date": "3-Apr-1965",
    "Place": "OAT",
    "ForeignKeyType": "AlbumID",
    "ForeignKeyId": "0002",
    "Album": "Album 0002: Second Convocation, 1965",
    "Photographer": "C. Gourishankar - Gourishankar was born into a distinguished family on the 19th of September, 1936. His parents were Prof. C. Lakshminarayanan, a professor of Zoology at the Madras Christian College, and Mrs. Jayalakshmi. He was the youngest of their four children. Gourishankar was a man of many dimensions -geologist, photographer, writer, craftsman and artist are just some of the definitions that can be given to this man. Gourishankar finished his schooling at Madras Christian College School and later went on to do his intermediate at Loyola College. The year 1947 saw Gourishankar join the Geological Survey of India (GSI) in Calcutta. His profession led him on many an extensive survey all across India. He thoroughly enjoyed his work and his drive for perfection was already evident in the impeccable maps he drew, none of which needed corrections, and also the reports he wrote up. These are still available on the GSI website today. Gourishankar’s passion for geology went beyond the surveys he conducted. He also maintained a rockery at home that comprised of many rocks that he patiently trimmed himself. He would trim them in such a manner that it brought out the unique features and patterns of each rock. While Gourishankar was still employed at the GSI his photography hobby had started to take on a much more serious note. Temple photography was his hobby but his rapture for photography in general drove him to read extensively and collect more knowledge on the subject. . His technical precision and uncanny eye for detail had already begun to earn him a name in the Photography circle at the time. His photographs started to emerge in various publications. Another person who had a big impact on Gourishankar’s life at this point was none other than the famous Nature Photographer and artist, M. Krishnan. Gradually they became close correspondents and wrote each other letters always about developing photographs. Even their families grew acquainted and visited each other frequently. In the year 1953 Gourishankar was married to Mahalakshmi who was the daughter of Mr. R. Natarajan who worked In the Finance Ministry in Delhi and Visalakshi at the time. Later they had two children, Viji and Jeyan, born in 1961 and 1967 respectively. In the year 1960, when Gourishankar quit his job at the GSI Madras, having mastered his craft he dived right into Professional Photography as his next career. As a professional photographer Gourishankar started off by doing event, wedding and Industrial Photography. As an industrial photographer he took black and white photographs of factories, buildings and machinery for a number of Institutions. One such institution was Indian Institute of Technology, Madras. IITM was in its initial growth phase then. All through the 1960’s-70’s buildings and facilities mushroomed all over the campus. The campus was amok with dignitaries, German professors and plenty of activity, convocations and other such events. This is when Gourishankar stepped in to document these radical changes taking place. His first assignment at IIT Madras was to cover the Institute Day function, April 1961. Prof. Sengupto, the first director of IITM was a photography enthusiast himself and took a keen interest in Gourishankar’s work. He would often give Gourishankar suggestions and tips on how to take certain photographs. He was also amused by the lengths that Gourishankar would go to take photographs. Sometimes he would even climb trees to get the perfect angle for his shot and wait there until the clouds in the sky had the perfect composition! Prof. Hans Wagner commissioned Gourishankar to take photographs of each department with the purpose of documenting their development. At that time each department was quite isolated from one another and hadn’t the slightest idea what was happening in the other departments. Gourishankar’s photography helped bridge the gap between the departments during the initial days of the institute. His photographs were showcased in exhibitions at Madras Museum, the German Consulate and Alliance Francaise. Photography was a strenuous profession and Gourishankar continued his line of work until the age of 69 (year:1995). He passed away in 2002. "
}